{"/about-me/":{"data":{"":" ℹ️ Curiosity \u0026 Innovation\nI’m a technologist dedicated to transforming complex challenges into elegant solutions. Hello, I’m Hassaan. From a young age, I’ve been captivated by the intricate systems that power our world. At 16, I delved into programming and discovered a profound satisfaction in bringing abstract concepts to life through code. The seamless blend of intangible logic and tangible outcomes in technology continues to fuel my passion and drive.\nWork Experience Projects Education \u0026 Achievements Software Engineer | Freelancing Developed scalable game servers using advanced IP masking and private routing. Engineered robust Linux systems with built-in redundancies. Built facial recognition tools and efficient web scrapers for high-volume data extraction. Data Scientist | HWCM LLC (USA, Florida) Deployed trading strategies with custom analytics and visualization tools. Integrated real-time data processing with containerization and version control. Automated workflows and resolved critical bugs for live trading systems. Open Source Intern | InfoTab Enterprises (UK, London) Contributed code enhancements and submitted impactful pull requests. Collaborated on cross-platform projects to improve system functionalities. Embedded Software Engineer | HWCM LLC (USA, Florida) Developed an IoT-based hygiene monitoring system for healthcare. Optimized a C/C++ codebase for improved performance and reduced development time. Implemented robust data protocols and remote diagnostics. Selected Projects\nLumibot Patch: Fixed a critical bug affecting live trading. CODETHESAUR.US: Enhanced Python learning resources on stacks and queues. Python Scraper: Engineered a tool using Scrapy to collect high-volume job market data. ToDo Master: Built a multi-user task management app in C++. SimplePyImgComp: Developed an efficient, multi-threaded image compressor. OLX Clone: Created a prototype marketplace using Android Studio. Education\nIntermediate (Pre-Engineering)\nIslamia College Peshawar, Pakistan (08/2020 – 06/2022)\nBachelor of Software Engineering\nFAST-NUCES, Pakistan (08/2022 – 06/2026)\nCompetitive Programming \u0026 Technical Competitions\nICPC: Online and onsite qualifier in 2023 and 2024. IEEExtreme: National ranking of 17th in 2022; advanced to 3rd nationally (97th globally) in 2023 and 2nd nationally in 2024 ACM Hackathon: Runner-up position (10/2022). CodeRush: Winner for cleanest code (06/2023). NUTEC’24 \u0026 FPSC’24: Top performer in regional and inter-university contests (04/2024, 05/2024). Leadership \u0026 Communication\nPresident ACM FAST-NUCES Chapter: Performed various technical events including workshops and programming competitions. Teaching Role: Assisted in various programming courses for multiple years. "},"title":"About Me"},"/blog/installing-and-setting-up-hugo-with-the-hextra-theme-a-step-by-step-guide/":{"data":{"":"","1-introduction#1. Introduction":"","10-troubleshooting--faqs#10. Troubleshooting \u0026amp; FAQs":"","11-conclusion--additional-resources#11. Conclusion \u0026amp; Additional Resources":"Welcome to my comprehensive guide on using Hugo with the Hextra theme. In this document, I share a step-by-step process, from installation to deployment, that will help you build a modern, responsive website with ease.\nSource CodeThe source code for the entire project is available on my GitHub. 1. Introduction Welcome to this guide on installing and setting up Hugo with the Hextra theme. In this post, we’ll walk you through everything you need to get started, from installing Hugo to configuring the Hextra theme, so you can build a beautiful, modern website or blog.\nWhat is Hugo? Hugo is a fast, modern, and flexible static site generator that transforms your Markdown files into a fully functional website. With its impressive speed and extensive customization options, Hugo is a favorite among developers and content creators alike.\nIntroducing Hextra Hextra is a modern, responsive Hugo theme designed to help you create professional blogs and documentation sites with ease. Key features include:\nResponsive Design: Adapts seamlessly to mobile, tablet, and desktop devices. Dark and Light Modes: Easily toggle between themes to match your content or audience preference. Built-In Full-Text Search: Powered by FlexSearch, enabling quick and efficient content search. Customizable Layouts and Components: Simplify your site’s configuration and design with a variety of out-of-the-box options. In this guide, you’ll learn how to:\nSet up Hugo on your system. Create a new Hugo site. Install and configure the Hextra theme using either Hugo Modules or Git Submodules. Create your first content pages and preview your site locally. Explore deployment options and troubleshooting tips. Let’s get started on building a powerful website with Hugo and Hextra!\n2. Prerequisites Before diving into setting up Hugo with the Hextra theme, ensure you have the following tools and knowledge in place.\nRequired Software Hugo (Extended Version)Hugo is a fast static site generator that transforms Markdown files into a full website. GitGit is essential for version control and managing theme modules or submodules. Go (Optional)While not mandatory, having Go installed can help with module management. Basic Knowledge and Skills Command-Line Usage: You should be comfortable using terminal commands. Markdown: Familiarity with Markdown syntax is necessary for creating and editing content. Git Basics: Understanding Git operations (clone, commit, push) will be beneficial. Need More Info? For beginners, here are some useful resources:\nHugo Documentation Git Book Markdown Guide 3. Installing Hugo In this step, we’ll install the extended version of Hugo, a requirement for taking full advantage of the Hextra theme.\nOfficial Hugo Installation Guide Important\nEnsure you download and install the extended version of Hugo, which includes SCSS processing and other advanced features needed by Hextra.\nmacOSLinuxWindows Install Hugo Using Homebrew, run:\nbrew install hugo Verify Installation Run:\nhugo version You should see the installed Hugo version.\nInstall Hugo Using Snap, run:\nsudo snap install hugo --channel=extended Verify Installation Run:\nhugo version Ensure the correct version is displayed.\nInstall Hugo Using Chocolatey, run:\nchoco install hugo-extended -y Verify Installation Run:\nhugo version Confirm that Hugo is installed by checking the version output.\nTip\nIf you prefer not to use a package manager, you can manually download the Hugo Extended binary from the Hugo Releases page and follow the provided installation instructions.\nOnce Hugo is installed and verified, you’re ready to move on to creating your new Hugo site!\n4. Creating a New Hugo Site In this step, you’ll create a new Hugo site that will serve as the foundation for your project.\nNote\nReplace my-site with your desired project name.\nOpen Your Terminal Open your preferred terminal application.\nCreate the Site Run the following command to create a new Hugo site using YAML as the configuration format:\nhugo new site my-site --format=yaml Navigate to Your Site Directory Change into your new site’s directory:\ncd my-site Important\nThis command sets up the basic directory structure for your Hugo site. You’ll see folders like content, layouts, static, etc.\nOnce your site is created, you’re ready to install the Hextra theme and move on to configuration.\n5. Installing the Hextra Theme Tip\nThe Hugo Modules method is recommended because it automatically handles theme updates and dependencies.\nHugo ModulesGit Submodules Initialize the Hugo Module Note\nReplace yourusername/mysite with your username and desired project name. Navigate to your site directory and run:\nhugo mod init github.com/yourusername/my-site Add the Hextra Theme Run the following command to add Hextra:\nhugo mod get github.com/imfing/hextra Configure Your Site Open your hugo.yaml (or equivalent config file) and add the following to import the theme:\nmodule: imports: - path: github.com/imfing/hextra Add Hextra as a Submodule Run this command in your site directory:\ngit submodule add https://github.com/imfing/hextra.git themes/hextra Update the Configuration File In your hugo.yaml, set the theme by adding:\ntheme: hextra Once you’ve installed Hextra using your preferred method, you’re ready to move on to configuring the theme for your site.\n6. Configuring the Hextra Theme Once you’ve installed the Hextra theme, it’s time to configure it to suit your site’s needs. This is done by editing your configuration file (e.g., hugo.yaml) in your site’s root directory.\nTip\nHextra offers a wide range of configuration options for customizing your site’s layout, navigation, and appearance. For more details, refer to the Hextra Documentation.\nOpen Your Configuration File Locate and open the configuration file (for example, hugo.yaml) in the root directory of your Hugo site.\nSet Basic Site Parameters Define your site’s essential details such as the base URL, title, and language:\nNote\nReplace baseURL, title and languageCode with your desired values.\nbaseURL: \"https://example.com/\" title: \"My Hugo Site\" languageCode: \"en-us\" Configure Hextra-Specific Settings Customize the Hextra theme by adding or updating the following parameters under params:\nparams: navbar: displayTitle: true displayLogo: true logo: path: \"images/logo.svg\" dark: \"images/logo-dark.svg\" link: \"/\" width: 40 height: 20 theme: default: system # Options: system, light, dark displayToggle: true Customize Menus and Other Elements Set up your navigation menu and other site elements as needed:\nmenu: main: - name: \"Documentation\" pageRef: \"/docs\" weight: 1 - name: \"Blog\" pageRef: \"/blog\" weight: 2 Important\nAfter updating your configuration, restart your Hugo server to apply the changes.\nWith your Hextra theme now configured, you’re ready to start creating content and further customizing your site.\n7. Creating Your First Content Pages Now that your Hugo site is set up and the Hextra theme is configured, it’s time to start adding content to your site. In this step, you’ll create a homepage and a documentation page using Hugo’s new command.\nTip\nUse the hugo new command to quickly generate content files with the appropriate front matter.\nCreate the Homepage Run the following command to generate your homepage:\nhugo new content/_index.md Create the Documentation Page Generate a new page for documentation:\nhugo new content/docs/_index.md Edit Your Content Files Open the newly created files in your preferred text editor. Customize the front matter and add your content. For example, your content/_index.md might start like this:\n--- title: \"Welcome to My Hugo Site\" date: 2025-01-01T12:00:00Z draft: true --- Then add your Markdown content below the front matter.\nImportant\nRemember: Set draft: false to publish your content on your live site.\nFor more details on organizing content, you might find the following resource helpful: Hugo Content Organization Once you’ve created and customized your content pages, you’re ready to preview your site locally.\n8. Running the Site Locally Now that your content is in place, it’s time to preview your site locally and see your changes in action.\nTip\nUse the hugo server command with the --buildDrafts flag to preview draft content and --disableFastRender for more reliable live-reloading.\nStart the Local Server Open your terminal in your site’s root directory and run:\nhugo server --buildDrafts --disableFastRender Access Your Site Once the server is running, open your browser and navigate to:\nhttp://localhost:1313/ Test Your Changes Edit your content files and save them, your site should automatically refresh to reflect your changes.\nImportant\nIf you encounter any issues, review your terminal output for error messages and ensure your configuration files are correctly set up.\nWith your site running locally, you can now test and fine-tune your content before moving on to deployment.\n9. Deployment Options Once your site is running perfectly on your local machine, it’s time to deploy it and share it with the world. Hugo’s static output makes deployment quick and simple across many hosting platforms.\nTip\nGitHub Pages is the recommended deployment option as it is free and the easiest.\nBuild Your Site for Production Run the following command to generate the production-ready files:\nhugo --gc --minify This command cleans up unused files and minifies your site’s assets for optimal performance.\nDeploy Your Site I recommend the following deployment methods:\nGitHub PagesNetlifyCloudflare PagesVercelOthers For GitHub Pages, you can push the contents of your public/ folder to the gh-pages branch, or use GitHub Actions. For example, you might use the workflow below:\nGitHub Actions Configuration Here is a sample workflow\n.github/workflows/pages.yamlname: Deploy Hugo site to Pages on: push: branches: [\"main\"] workflow_dispatch: permissions: contents: read pages: write id-token: write concurrency: group: \"pages\" cancel-in-progress: false defaults: run: shell: bash jobs: build: runs-on: ubuntu-latest env: HUGO_VERSION: 0.138.0 steps: - name: Checkout uses: actions/checkout@v4 with: fetch-depth: 0 submodules: recursive - name: Setup Go uses: actions/setup-go@v5 with: go-version: '1.22' - name: Setup Pages id: pages uses: actions/configure-pages@v4 - name: Setup Hugo run: | wget -O ${{ runner.temp }}/hugo.deb https://github.com/gohugoio/hugo/releases/download/v${HUGO_VERSION}/hugo_extended_${HUGO_VERSION}_linux-amd64.deb \\ \u0026\u0026 sudo dpkg -i ${{ runner.temp }}/hugo.deb - name: Build with Hugo env: HUGO_ENVIRONMENT: production HUGO_ENV: production run: | hugo --gc --minify --baseURL \"${{ steps.pages.outputs.base_url }}/\" - name: Upload artifact uses: actions/upload-pages-artifact@v3 deploy: environment: name: github-pages url: ${{ steps.deployment.outputs.page_url }} runs-on: ubuntu-latest needs: build steps: - name: Deploy to GitHub Pages id: deployment uses: actions/deploy-pages@v4 By default, this workflow deploys to https://\u003cUSERNAME\u003e.github.io/\u003cREPO\u003e/. Update the --baseURL parameter if you need to deploy to https://\u003cUSERNAME\u003e.github.io/ or your own domain.\nConnect your repository to Netlify. Set the Build command to hugo --gc --minify and the Publish directory to public. If needed, add the environment variable HUGO_VERSION with the value 0.138.0. To use Cloudflare Pages:\nPush your site source code to a Git repository (e.g. GitHub). In the Cloudflare dashboard, select your account and go to Workers \u0026 Pages \u003e Create application \u003e Pages \u003e Connect to Git. When setting up builds and deployments, use these configuration values: Configuration Value Production branch main Build command hugo --gc --minify Build directory public For more details, check the Deploy a Hugo site guide. Import your Hugo project into Vercel via the Vercel Dashboard. In your project settings, select Hugo as the Framework Preset and override the commands as follows:\nBuild Command: hugo --gc --minify Install Command: yum install golang You can also deploy on Firebase or another static hosting provider by using their specific deployment instructions. Important\nBefore deploying: Ensure that all content is finalised and that your site works flawlessly on your local server.\nAdditional Resources Netlify GitHub Pages Vercel Once deployed, your site will be live at your configured domain, and you can share it with the world. Enjoy your new Hugo-powered website!\n10. Troubleshooting \u0026 FAQs Sometimes things may not work as expected. In this step, we’ll cover some common issues and provide tips for resolving them.\nImportant\nAlways review your terminal output for error messages. Many issues can be quickly resolved by checking the logs.\nCheck Your Configuration Ensure that your configuration file (e.g., hugo.yaml) is correctly formatted and contains all necessary parameters. Tip: Use an online YAML validator if you’re unsure.\nReview Terminal Logs When running hugo server or building your site, check your terminal for error messages or warnings that may indicate misconfigurations or missing files.\nVerify Theme Installation Confirm that Hextra is correctly installed:\nFor Hugo Modules: Check your hugo.mod file and the module import in your configuration. For Git Submodules: Ensure the themes/hextra directory exists and is populated. Consult the Documentation Refer to the Hextra Documentation and the Hugo Documentation for further guidance on troubleshooting specific issues.\nTip\nIf a page isn’t rendering as expected, double-check the front matter in your Markdown files for correct syntax and required fields.\n11. Conclusion \u0026 Additional Resources In this final step, we wrap up the guide and provide you with additional resources to help you further customize your site and troubleshoot any issues.\nConclusion You’ve now learned how to:\nInstall Hugo Extended. Create a new Hugo site. Install the Hextra theme using either Hugo Modules or Git Submodules. Configure the theme to match your needs. Create and manage your content pages. Run your site locally for testing. Deploy your website. With these steps, you have a solid foundation for building a beautiful and responsive website using Hugo and Hextra. Enjoy experimenting with advanced customizations and make your site truly your own!\nAdditional Resources Hugo Documentation Hextra Theme Documentation Hugo GitHub Repository Important\nKeep exploring, stay curious, and don’t hesitate to seek help in the Hugo and Hextra communities if you need further assistance.\nThank you for following this guide, and happy coding!","2-prerequisites#2. Prerequisites":"","3-installing-hugo#3. Installing Hugo":"","4-creating-a-new-hugo-site#4. Creating a New Hugo Site":"","5-installing-the-hextra-theme#5. Installing the Hextra Theme":"","6-configuring-the-hextra-theme#6. Configuring the Hextra Theme":"","7-creating-your-first-content-pages#7. Creating Your First Content Pages":"","8-running-the-site-locally#8. Running the Site Locally":"","9-deployment-options#9. Deployment Options":""},"title":"Installing and Setting Up Hugo With the Hextra Theme: a Step by Step Guide"},"/blog/solar-guide-pakistan/":{"data":{"":"","1-intro-why-consider-solar-in-pakistan-now#1. Intro: Why Consider Solar in Pakistan Now?":"","2-understanding-your-bill-net-metering-rules-current-as-of-early-2025#2. Understanding Your Bill: Net Metering Rules (Current as of Early 2025)":"","3-system-types-choosing-the-right-setup#3. System Types (Choosing the Right Setup)":"","4-sizing--costs-example-10kw-system#4. Sizing \u0026amp; Costs (Example: 10kW System)":"Welcome to this comprehensive guide on navigating the world of residential solar power in Pakistan as of early 2025. Whether you’re tired of high electricity bills, seeking energy independence during load shedding, or looking for a sound long-term investment, this guide aims to provide the clarity you need.\nWarning\nDISCLAIMER: Please read carefully: All pricing information and solar policy details mentioned herein reflect the situation as of early 2025 and are subject to change, especially with upcoming government budgets or potential regulatory updates by NEPRA/AEDB. The Net Billing concept is discussed as a possibility, but current installations operate primarily under the Net Metering rules outlined below. For the most accurate and up-to-date pricing and eligibility confirmation for your specific situation, always contact several reputable, AEDB/PPIB certified solar installation companies for free quotes. This post aims to share information based on research and experience; navigating specific site challenges or optimizing designs sometimes benefits from tailored analysis, which may be offered professionally. The author is not affiliated with any specific installation company or solar brand.\n1. Intro: Why Consider Solar in Pakistan Now? Many Pakistani households face the dual challenge of relentlessly high grid electricity costs (often exceeding PKR 60-70/unit peak with taxes) and disruptive load shedding. In this economic climate, solar power has emerged as a compelling solution.\nContext: While previous, highly favorable net metering policies led to exceptionally fast payback periods (often under 5 years), recent policy adjustments have changed the ROI calculation (detailed later). However, the core drivers remain strong.\nGood News: A significant positive development is the major drop in global prices for high-efficiency Tier 1 / Grade A Bifacial solar panels. These panels capture sunlight from both sides, boosting generation, and their reduced cost significantly lowers the initial investment barrier.\nPurpose of this Guide: This document provides a practical breakdown of current costs, explains the crucial Net Metering policy, walks through system types, sizing, battery considerations, and performs an ROI analysis using a common example: a household initially consuming 9,600 kWh annually (average 800 kWh/month), later adjusted to 11,500 kWh/year for ROI calculations to reflect typical post-solar usage increases. We focus on a 10kW system, a popular size for this consumption level, but the principles apply broadly.\n2. Understanding Your Bill: Net Metering Rules (Current as of Early 2025) Understanding how your solar system interacts with the grid and your electricity bill is fundamental. Pakistan’s current framework primarily operates under Net Metering rules.\nHow Solar Saves You Money: Self-Consumption is Key The primary way a typical grid-tied solar system saves you money is through “Self-Consumption”.\nGrid-Tied Operation Explained: Parallel System: Your solar installation runs in parallel with the utility grid. Solar Power Flow: Generated electricity flows into your home’s main distribution box (DB). Priority Usage: Appliances automatically draw from available solar energy first. Grid as Backup/Supplement: The grid instantly provides power if demand exceeds solar production, or absorbs surplus if production exceeds demand. The Value of Self-Consumption: Direct Offset: Every kWh of solar energy your home consumes as it’s generated is a kWh you don’t buy from your DISCO. High Tariff Avoidance: You avoid paying the high grid tariff (PKR 65+/unit assumed for calculations) for every self-consumed kWh. Daylight Limitation: This direct saving only occurs during daylight hours. Tip\nMaximize self-consumption by shifting heavy appliance usage (ACs, water pumps, irons, washing machines) to daytime hours.\nHandling Excess Power: The Net Metering Process Surplus solar energy goes onto the grid via a special bidirectional net meter installed by your DISCO (e.g., LESCO, K-Electric, IESCO).\nMeter Tracking: Records units imported from the grid and units exported to the grid separately. Monthly Billing Cycle: Within a single billing month, exported units offset imported units on a one-to-one (1:1) basis. Example 1: Import 500 kWh, Export 400 kWh -\u003e Bill for Net 100 kWh (+ fixed charges/taxes). Example 2: Import 300 kWh, Export 500 kWh -\u003e Bill for fixed charges/taxes only; Net Export Credit of 200 kWh carried forward. Quarterly Payout/Reconciliation: Accounts are fully reconciled every three months. If a net export surplus exists after three months (total export \u003e total import), the DISCO pays for these final excess units. Crucial Rate Change: For systems approved after March 2025, this payout is at the new, lower rate of PKR 10 per unit. Strategy \u0026 Sizing Implications Focus on Daytime Load: Size your system to cover typical daytime needs effectively. Avoid Gross Oversizing: The low PKR 10/unit surplus payout makes systems vastly larger than annual consumption less financially efficient now. Important\nNote on Potential “Net Billing”: There’s ongoing discussion about a potential future shift to “Net Billing.” While Net Metering (as described above) is the current standard, a Net Billing model might eliminate the 1:1 monthly offset, billing all imports at the full rate and crediting all exports at the low flat rate (e.g., PKR 10/unit) instantly. This possibility further emphasizes maximizing self-consumption. Always verify current rules with your DISCO/installer.\n3. System Types (Choosing the Right Setup) Selecting the appropriate system type is crucial.\nOn-Grid (Grid-Tied) Description: Most common for grid-connected homes. Connects panels and inverter directly to the grid via the net meter. Uses Net Metering for bill reduction. Limitation: Automatically shuts down during grid outages (load shedding) for safety. No backup power. Cost: Least expensive option (no batteries). Hybrid Description: Grid-tied system that adds a Battery Bank and uses a specialized Hybrid Inverter. Uses Net Metering AND provides backup power during outages. Operation During Outage: Battery powers essential loads. Solar panels can continue operating (if sun is available and battery isn’t full) to power loads directly or recharge the battery. Cost: Middle cost bracket – significantly more than On-Grid due to batteries and hybrid inverter, but cheaper than full Off-Grid. Often the most practical balance for Pakistan. Off-Grid Description: Completely independent of the utility grid. Relies solely on solar panels and a large Battery Bank with an Off-Grid inverter. Use Case: Essential for locations with no grid access or where reliable grid connection/net metering is impossible. Limitation: Requires substantial, costly battery capacity for 24/7 power, especially during low-sun periods. Careful sizing is critical. Cost: Most expensive option due to the large battery bank needed. Other System Note: Grid-Tied without Net Metering Some systems use “export limiters” or “zero export devices.” These allow self-consumption but prevent excess power export to the grid, avoiding net metering needs but wasting potential surplus generation. Less common for residential bill reduction. Caution\nCritical Safety Feature: Anti-Islanding Protection ALL systems connected to the grid (On-Grid and Hybrid) MUST have functional Anti-Islanding Protection. This mandatory safety feature (built into certified inverters) automatically detects grid outages and shuts down the inverter’s output to the grid. This prevents electrocution risk for utility workers repairing lines they assume are dead. Never disable or bypass this feature.\n4. Sizing \u0026 Costs (Example: 10kW System) Accurate sizing and cost estimation are vital. We use an example targeting ~11,500 kWh/year consumption (based on 9,600 kWh/yr initial use + 20% buffer).\nSizing Your System Analyze Consumption Gather 12 months of electricity bills, sum total kWh used (e.g., 9,600 kWh/year).\nAccount for Future Use \u0026 Buffer Add a buffer (15-20%) for potential increased usage post-solar. Target: 9,600 kWh * 1.2 ≈ 11,500 kWh/year.\nChoose System Size For this target in Pakistan, a 10 kW inverter with 12 kW of solar panels is common. Installing more panel capacity than inverter rating (e.g., 1.2x) is called oversizing. This helps maximize energy harvest, especially in lower light conditions, by running the inverter closer to peak efficiency more often.\nEstimate Generation This 10kW/12kWp setup should generate 13,000 - 15,000 kWh/year typically, assuming minimal downtime from grid outages (On-Grid systems stop producing during load shedding).\nComponent \u0026 Installation Cost Breakdown (Estimates - Early 2025 - GET MULTIPLE QUOTES!) Prices fluctuate based on brand, quality, installer margins, PKR/USD rate. These are estimates only.\nComponent Recommendation / Notes Estimated Cost (PKR) Solar Panels (12 kW) Tier 1 / Grade A Bifacial (Jinko, Longi, JA, Canadian Solar common). Approx. 28-32 PKR/watt. 336,000 - 384,000 Inverter (10 kW Hybrid) Hybrid offers future battery flexibility. Reputable brands (Solis, Huawei, Goodwe, Inverex Nitrox/Aerox). Approx. 50k PKR/kW rating. ~500,000 Mounting Structure Securely holds ~18-24 panels (e.g., 550W panels). Quality GI/Aluminum vital. Elevated structure often preferred (better airflow, usable space below); Approx. 9k-11k PKR/panel installed. 160,000 - 260,000 (Elevated) Structure Design Note Continuous structures with back rows elevated prevent self-shading. Tilt angle (~25-30°) affects energy capture \u0026 structure height. See tilt calculations below. - Wiring, Conduits, Safety Quality DC/AC cables, MC4 connectors, conduits, AC/DC breakers, Surge Protection Devices (SPDs). Approx. 3k PKR/panel rough estimate. 55,000 - 75,000 Installation Labour Physical mounting, wiring, connection. Varies by complexity. ~50,000 Grounding System ESSENTIAL for safety (faults, lightning). Proper earth pits/rods, wiring. Cost varies with distance to effective grounding location. 40,000 - 80,000+ Net Meter Cost DISCO fee for meter \u0026 application processing. ~45,000+ (Official) “Chai Pani” (Unofficial) Potential costs to expedite lengthy meter approval/installation. Patience with the official process is advised. (50,000 - 150,000+ ?) ESTIMATED TOTAL (NO BATTERY) 10kW Hybrid-Ready System ~1,200,000 - 1,600,000 Mounting Structure Tilt \u0026 Height Calculation Example Understanding how tilt affects space and height:\nA panel’s horizontal footprint (L_base) shrinks as tilt (theta) increases: L_base = L0 * cos(theta) Example: An 8m long panel row (L0 = 8m) tilted 30° takes up L_base = 8 * cos(30°) ≈ 6.9m horizontally. The panel’s vertical rise (Height) increases with tilt: Height = L0 * sin(theta) Example: Same 8m row at 30° tilt rises Height = 8 * sin(30°) = 4.0m vertically from its base. Implication: Tilt optimizes energy capture but increases structure height and wind load considerations, potentially impacting design and cost. Must comply with local building codes. Installer Choice is CRITICAL Certification: MUST Use AEDB/PPIB CERTIFIED Installers. Check official lists. Mandatory for Net Metering. Due Diligence: Reputation \u0026 After-Sales Service are KEY. Don’t just pick the cheapest. Get multiple detailed quotes. Check reviews (Google, social media). Ask for references. Reliable support is worth a premium. Avoid unprofessional/evasive installers. Warning\nSafety First! Ensure your installer uses quality, certified components (wiring, breakers, SPDs), implements proper grounding, and correctly configures all safety features. Never compromise on safety.","5-batteries-backup-vs-roi#5. Batteries: Backup vs. ROI":"Adding batteries significantly impacts cost and functionality.\nRecommendation: If reliable Net Metering is available and your primary goal is the fastest ROI, avoid large battery banks initially. Why Caution on ROI? Panels have 25-year warranties; inverters might last 10-15+ years. Lithium Iron Phosphate (LiFePO4) batteries (recommended for safety/longevity) typically last 10-15 years (or 4000-6000 charge cycles). They are expensive (~PKR 80,000/kWh capacity estimate) and will likely need replacement before panels expire, significantly impacting lifetime savings. Avoid older Lead-Acid batteries: Cheaper upfront but much shorter lifespan (3-5 yrs), lower efficiency, maintenance needs, and weight make them generally unsuitable. When Batteries Make Sense - Backup Needs Hybrid System (Recommended Backup Strategy): For typical load shedding, a small 5 kWh LiFePO4 battery (~PKR 400,000 est.) offers a practical balance. It can run essential loads (lights, fans, fridge, router) for several hours, possibly one efficient AC briefly. Larger Backup: A 10kWh battery provides longer backup or supports slightly heavier loads (cost increases proportionally). Off-Grid / Full House Backup: Running multiple ACs or entire house requires a much larger bank (e.g., 20-25 kWh capacity needed for 15-20 kWh overnight usage), costing ~PKR 2,000,000+ for batteries alone. Estimating Backup Battery Needs A rough guide: Required Battery Capacity (kWh) ≈ (Avg. Power Draw of Essential Loads [Watts] × Hours of Backup Needed) / (1000 × 0.9) (The 0.9 accounts for ~90% usable capacity/Depth of Discharge limit for LiFePO4). Calculate based on your specific essential appliances. ","6-roi-calculation-example-10kw-system-varying-battery#6. ROI Calculation (Example: 10kW System, Varying Battery)":"How quickly does the system pay for itself through savings?\nUnderstanding the Calculation \u0026 Basis Consumption Assumption for ROI: We use the adjusted figure of 11,500 kWh/year effectively offset by the system (accounting for post-solar usage increase). System Generation Assumption: We assume the 10kW/12kWp system generates 14,000 kWh/year. Core Logic (Important Correction): The maximum financial benefit at the high grid tariff (PKR 65/kWh assumed) is capped by your actual annual consumption (11,500 kWh/yr). Any generation beyond this (14,000 - 11,500 = 2,500 kWh surplus) can only be compensated at the low export rate (PKR 10/kWh), regardless of Net Metering vs. Net Billing. Formula: Payback Period (Years) = Total Initial System Cost / Total Annual Savings Annual Savings: Calculated based on grid usage offset, surplus export value, and any added value from battery discharge during specific outage scenarios. Effective Battery Factor (EBF) \u0026 Added Battery Value Batteries provide backup, but their additional financial value beyond simply shifting export depends on when they discharge relative to grid/solar availability.\nMarginal Benefit Idea: Discharging 1 kWh from battery avoids buying 1 kWh at PKR 65. Without the battery, that solar energy might only fetch PKR 10 if exported. Theoretical gain = PKR 55/kWh. Reality Check (EBF): This gain is only fully realized if discharging during a grid outage when solar is also unavailable. We use an Effective Battery Factor (EBF) to estimate this limited scenario: EBF = O / (T – S) Where O = average weekly outage hours (assumed 12 hrs), T = total weekly hours (168), S = average weekly solar production hours (assumed 49 hrs, ~7 hrs/day). EBF = 12 / (168 – 49) = 12 / 119 ≈ 0.10 Effective Added Value per Battery kWh: (PKR 65 - PKR 10) × EBF = PKR 55 × 0.10 = PKR 5.5 / kWh Estimated Annual Added Savings from Battery (based on EBF \u0026 assumed discharge): 5kWh Battery: ~1350 kWh/yr × PKR 5.5 ≈ PKR 7,425 10kWh Battery: ~2700 kWh/yr × PKR 5.5 ≈ PKR 14,850 25kWh Battery: ~6750 kWh/yr × PKR 5.5 ≈ PKR 37,125 Note\nThis EBF calculation shows that with these specific outage assumptions, the purely financial added benefit of batteries (beyond backup convenience) is relatively small, significantly impacting ROI calculations that factor in battery cost.\nGrid Price Assumption: We use PKR 65/kWh as an illustrative average grid cost avoided. Check your own bills! Grid prices will likely rise, making these payback estimates conservative. Scenario 1: ROI under Current Net Metering Rules Assumption: 1:1 monthly credit rollover allows offsetting the full 11,500 kWh consumption at the high rate. Surplus (2,500 kWh) gets the low rate.\nValue from Offsetting Grid Usage: 11,500 kWh × PKR 65/kWh = PKR 747,500 Value from Surplus Export: 2,500 kWh × PKR 10/kWh = PKR 25,000 Total Annual Savings (No Battery): 747,500 + 25,000 = PKR 772,500 Total Annual Savings (Incl. Battery Added Value via EBF): 5kWh Battery: 772,500 + 7,425 ≈ PKR 779,925 10kWh Battery: 772,500 + 14,850 ≈ PKR 787,350 25kWh Battery: 772,500 + 37,125 ≈ PKR 809,625 Calculated Payback (Using Est. 1.4M Base Cost + Battery Costs): No Battery: 1.4M / 772.5k ≈ 1.81 years 5kWh Battery (Est. 1.8M total): 1.8M / 780k ≈ 2.31 years 10kWh Battery (Est. 2.2M total): 2.2M / 787k ≈ 2.80 years 25kWh Battery (Est. 3.4M total): 3.4M / 810k ≈ 4.20 years Scenario 2: ROI under Potential Future Net Billing Assumption: Strict Net Billing model. Only directly self-consumed solar (assumed 40% SCR = 5,600 kWh) gets the high rate (PKR 65). All remaining generation (8,400 kWh) valued at export rate (PKR 10) at generation time. Battery added value mainly via EBF during outages.\nValue from Direct Self-Consumption (40% SCR): 5,600 kWh × PKR 65/kWh = PKR 364,000 Value from All Other Generation (@PKR 10): 8,400 kWh × PKR 10/kWh = PKR 84,000 Total Annual Savings (No Battery): 364,000 + 84,000 = PKR 448,000 Total Annual Savings (Incl. Battery Added Value via EBF): 5kWh Battery: 448,000 + 7,425 ≈ PKR 455,425 10kWh Battery: 448,000 + 14,850 ≈ PKR 462,850 25kWh Battery: 448,000 + 37,125 ≈ PKR 485,125 Calculated Payback (Using Est. 1.4M Base Cost + Battery Costs): No Battery: 1.4M / 448k ≈ 3.13 years 5kWh Battery (Est. 1.8M total): 1.8M / 455k ≈ 3.95 years 10kWh Battery (Est. 2.2M total): 2.2M / 463k ≈ 4.75 years 25kWh Battery (Est. 3.4M total): 3.4M / 485k ≈ 7.00 years Perspective \u0026 Summary Table Key Difference: Net Metering values generation up to consumption limit at the high rate via credits. Net Billing heavily devalues non-instant self-consumption. Surplus gets low rate in both. EBF Impact: The low EBF (based on these outage assumptions) significantly reduces the calculated financial added value of batteries, making their justification primarily backup convenience, not ROI enhancement. Reality Check: These are ideal calculations. Actual payback depends on usage, stable pricing, system performance. A realistic real-world payback for a no-battery system might be 4–7 years. Batteries add cost \u0026 extend payback but provide crucial backup value. Battery Size Est. Net Metering Payback (Years) Est. Net Billing Payback (Years) Estimated Battery Cost (PKR) Total System Cost Est. (PKR) No Battery ~1.8 ~3.1 0 ~1,400,000 5 kWh ~2.3 ~4.0 ~400,000 ~1,800,000 10 kWh ~2.8 ~4.8 ~800,000 ~2,200,000 25 kWh ~4.2 ~7.0 ~2,000,000 ~3,400,000 ","7-financing-my-take#7. Financing (My Take)":" Recommendation: Pay outright if possible. Avoids interest charges and maximizes long-term savings. Solar is a long-term investment. Personal Note: Loan interest complicates ROI and always extends payback. If financing is essential, thoroughly investigate options like the State Bank of Pakistan’s (SBP) renewable energy scheme via commercial banks. Understand all terms, rates (markup), fees, and documentation before committing. Ensure the financing cost doesn’t negate the benefits. ","8-quick-faqs#8. Quick FAQs":" What maintenance does a solar system need? Primary: Monthly panel cleaning (water, soft brush/wiper) is crucial, especially in dusty areas, to maintain production. DIY or hire services. Monitoring: Periodically check inverter display/app for errors. Professional Check: Consider an inspection (connections, structure) every 1-2 years as per installer recommendation. How long do the components last? Solar Panels: 25-year performance warranty (guaranteed output %); 10-12 year product warranty typical. Can last 30+ years with gradual degradation. Inverters (String/Hybrid): 5-year standard warranty (often extendable to 10). Expected lifespan 10-15+ years. Most likely component needing replacement over system life. Lithium (LiFePO4) Batteries: Rated in cycles (4000-6000) and years (often 10-year warranty). Expect 10-15 years useful life under typical hybrid backup usage (less if deep-cycled daily like off-grid). What happens during load shedding? On-Grid System: Shuts down completely. No power output, no backup. Hybrid / Off-Grid System: Provides backup power from battery (and potentially panels if sunny \u0026 battery has room). Duration depends on battery size and load. Can I install solar if I’m a renter? Possible, but requires clear written agreement with the landlord. Address ownership, payment, net meter responsibility, what happens upon moving out (removal, repair, transfer). Landlord permission is essential. Tenant usually applies for net meter in their name. Can be complex. Warning\nSafety Reminder: Safety is paramount. Use certified installers, insist on proper grounding, quality components (wiring, safety devices), and ensure mandatory features like Anti-Islanding are functional and untampered with.","9-conclusion#9. Conclusion":"Navigating solar in Pakistan (early 2025) requires focusing on maximizing self-consumption to offset high grid tariffs. While the low export rate limits returns on large surpluses, falling hardware costs keep solar viable. A well-sized system (e.g., 10kW for 800-1000 kWh/month usage) offers significant bill reduction potential.\nHybrid systems with 5-10kWh batteries provide invaluable backup against load shedding, a practical benefit often justifying the added cost and extended simple payback period for Pakistani households.\nKey Actions Recap:\nGet Quotes: From multiple, reputable, AEDB/PPIB certified installers. Prioritize quality/service. Calculate ROI: Based on your usage, realistic self-consumption, actual quotes, and current Net Metering rules. Prioritize Safety: Insist on standards for components, installation, and grounding. Solar remains a strong investment towards energy independence and savings. Plan carefully and choose wisely!\nAcknowledgment Compiling, verifying, and refining this detailed guide took considerable effort. AI assistance (like Gemini) was utilized to help structure outlines, perform calculations based on provided formulas and data, and polish the language under the author’s direction, correction, and final review. "},"title":"Pakistan Solar Guide 2025"},"/contact/":{"data":{"":"","get-in-touch#Get in Touch":"I’d love to hear from you! Whether you have questions, opportunities, or just want to say hello, you can reach out through any of the following channels:\nLinkedInConnect with me professionally EmailSend me an email DiscordMessage me on Discord Feel free to drop me a message on any of these platforms!"},"title":"Contact"},"/credits/":{"data":{"acknowledgments#Acknowledgments":" YannickDesign inspiration and invaluable mentorship Hisam SaharIntroduced these amazing tools through his presentation This site is open source. Found something that could be improved? Submit an issue or pull request.","building-blocks#Building Blocks":"Building BlocksThis website represents a blend of modern web technologies and thoughtful design choices. Built with Hugo, a lightning-fast static site generator, and enhanced by the elegant Hextra theme.","core-technologies#Core Technologies":" HugoThe world’s fastest framework for building websites HextraModern, batteries-included Hugo theme "},"title":"Credits"}}