{"/about-me/":{"data":{"":" ℹ️ Curiosity \u0026 Innovation\nI’m a technologist dedicated to transforming complex challenges into elegant solutions. Hello, I’m Hassaan. From a young age, I’ve been captivated by the intricate systems that power our world. At 16, I delved into programming and discovered a profound satisfaction in bringing abstract concepts to life through code. The seamless blend of intangible logic and tangible outcomes in technology continues to fuel my passion and drive.\nWork Experience Projects Education \u0026 Achievements Software Engineer | Freelancing Developed scalable game servers using advanced IP masking and private routing. Engineered robust Linux systems with built-in redundancies. Built facial recognition tools and efficient web scrapers for high-volume data extraction. Data Scientist | HWCM LLC (USA, Florida) Deployed trading strategies with custom analytics and visualization tools. Integrated real-time data processing with containerization and version control. Automated workflows and resolved critical bugs for live trading systems. Open Source Intern | InfoTab Enterprises (UK, London) Contributed code enhancements and submitted impactful pull requests. Collaborated on cross-platform projects to improve system functionalities. Embedded Software Engineer | HWCM LLC (USA, Florida) Developed an IoT-based hygiene monitoring system for healthcare. Optimized a C/C++ codebase for improved performance and reduced development time. Implemented robust data protocols and remote diagnostics. Selected Projects\nLumibot Patch: Fixed a critical bug affecting live trading. CODETHESAUR.US: Enhanced Python learning resources on stacks and queues. Python Scraper: Engineered a tool using Scrapy to collect high-volume job market data. ToDo Master: Built a multi-user task management app in C++. SimplePyImgComp: Developed an efficient, multi-threaded image compressor. OLX Clone: Created a prototype marketplace using Android Studio. Education\nIntermediate (Pre-Engineering)\nIslamia College Peshawar, Pakistan (08/2020 – 06/2022)\nBachelor of Software Engineering\nFAST-NUCES, Pakistan (08/2022 – 06/2026)\nCompetitive Programming \u0026 Technical Competitions\nICPC: Online and onsite qualifier in 2023 and 2024. IEEExtreme: National ranking of 17th in 2022; advanced to 3rd nationally (97th globally) in 2023 and 2nd nationally in 2024 ACM Hackathon: Runner-up position (10/2022). CodeRush: Winner for cleanest code (06/2023). NUTEC’24 \u0026 FPSC’24: Top performer in regional and inter-university contests (04/2024, 05/2024). Leadership \u0026 Communication\nPresident ACM FAST-NUCES Chapter: Performed various technical events including workshops and programming competitions. Teaching Role: Assisted in various programming courses for multiple years. "},"title":"About Me"},"/contact/":{"data":{"":"","get-in-touch#Get in Touch":"I’d love to hear from you! Whether you have questions, opportunities, or just want to say hello, you can reach out through any of the following channels:\nLinkedInConnect with me professionally EmailSend me an email DiscordMessage me on Discord Feel free to drop me a message on any of these platforms!"},"title":"Contact"},"/credits/":{"data":{"acknowledgments#Acknowledgments":" YannickDesign inspiration and invaluable mentorship Hisam SaharIntroduced these amazing tools through his presentation This site is open source. Found something that could be improved? Submit an issue or pull request.","building-blocks#Building Blocks":"Building BlocksThis website represents a blend of modern web technologies and thoughtful design choices. Built with Hugo, a lightning-fast static site generator, and enhanced by the elegant Hextra theme.","core-technologies#Core Technologies":" HugoThe world’s fastest framework for building websites HextraModern, batteries-included Hugo theme "},"title":"Credits"}}